

months_str_ru = {
    1: 'Января',
    2: 'Февраля',
    3: 'Марта',
    4: 'Апреля',
    5: 'Мая',
    6: 'Июня',
    7: 'Июля',
    8: 'Августа',
    9: 'Сентября',
    10: 'Октября',
    11: 'Ноября',
    12: 'Декабря',
}

yakutia_districts = [
    "Абыйский район",
    "Алданский район",
    "Аллаиховский район",
    "Амгинский район",
    "Анабарский национальный (долгано-эвенкийский) район",
    "Булунский район",
    "Верхневилюйский район",
    "Верхнеколымский район",
    "Верхоянский район",
    "Вилюйский район",
    "Горный район",
    "Жиганский национальный эвенкийский район",
    "Кобяйский район",
    "Ленский район",
    "Мегино-Кангаласский район",
    "Мирнинский район",
    "Момский район",
    "Намский район",
    "Нерюнгринский район",
    "Нижнеколымский район",
    "Нюрбинский район",
    "Олекминский район",
    "Оленёкский эвенкийский национальный район",
    "Оймяконский район",
    "Сунтарский район",
    "Таттинский район",
    "Томпонский район",
    "Усть-Алданский район",
    "Усть-Майский район",
    "Усть-Янский район",
    "Хангаласский район",
    "Чурапчинский район",
    "Эвено-Бытантайский национальный район",
    "Якутск (городской округ)"
]


upload_file_type = ['avi', 'doc', 'gif', 'jpg', 'mov', 'mp3', 'mp4', 'pdf', 'png', 'xls', 'zip']
